# vstDrawCoordRect

## Description
```pascal
PROCEDURE vstDrawCoordRect(
				ptLeftTopX : REAL;
				ptLeftTopY : REAL;
				ptRghtBotX : REAL;
				ptRghtBotY : REAL);
```

```python

def vs.vstDrawCoordRect(ptLeftTopX, ptLeftTopY, ptRghtBotX, ptRghtBotY):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ptLeftTopX|REAL||
|ptLeftTopY|REAL||
|ptRghtBotX|REAL||
|ptRghtBotY|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events